MCUdude/MegaCoreX/megaavr/boards.txt
3209.menu.clock.internal_2MHz=Internal 2 MHz
3209.menu.clock.internal_2MHz.upload.speed=115200
3209.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
3209.menu.clock.internal_2MHz.build.oscillator=
3209.menu.clock.internal_2MHz.build.f_cpu=2000000L

3209.menu.clock.internal_1MHz=Internal 1 MHz
3209.menu.clock.internal_1MHz.upload.speed=115200
3209.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
3209.menu.clock.internal_1MHz.build.oscillator=
3209.menu.clock.internal_1MHz.build.f_cpu=1000000L

3209.menu.clock.external_16MHz=External 16 MHz
3209.menu.clock.external_16MHz.upload.speed=115200
3209.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
3209.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3209.menu.clock.external_16MHz.build.f_cpu=16000000L

3209.menu.clock.external_12MHz=External 12 MHz
3209.menu.clock.external_12MHz.upload.speed=115200
3209.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
3209.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3209.menu.clock.external_12MHz.build.f_cpu=12000000L

3209.menu.clock.external_8MHz=External 8 MHz
3209.menu.clock.external_8MHz.upload.speed=115200
3209.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
3209.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3209.menu.clock.external_8MHz.build.f_cpu=8000000L

3209.menu.clock.external_4MHz=External 4 MHz
3209.menu.clock.external_4MHz.upload.speed=115200
3209.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
3209.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3209.menu.clock.external_4MHz.build.f_cpu=4000000L

3209.menu.clock.external_1MHz=External 1 MHz
3209.menu.clock.external_1MHz.upload.speed=115200
3209.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
3209.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3209.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
3209.menu.bootloader.no_bootloader=No bootloader
3209.menu.bootloader.no_bootloader.upload.maximum_size=32768
3209.menu.bootloader.no_bootloader.upload.extra_params=
3209.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
3209.menu.bootloader.no_bootloader.build.export_merged_output=false
3209.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
3209.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

3209.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
3209.menu.bootloader.uart0_default.upload.maximum_size=32256
3209.menu.bootloader.uart0_default.upload.protocol=arduino
3209.menu.bootloader.uart0_default.upload.port=UART0_DEF
3209.menu.bootloader.uart0_default.upload.extra_params=
3209.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
3209.menu.bootloader.uart0_default.build.export_merged_output=true
3209.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart0_default.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
3209.menu.bootloader.uart0_alternative.upload.maximum_size=32256
3209.menu.bootloader.uart0_alternative.upload.protocol=arduino
3209.menu.bootloader.uart0_alternative.upload.port=UART0_ALT
3209.menu.bootloader.uart0_alternative.upload.extra_params=
3209.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
3209.menu.bootloader.uart0_alternative.build.export_merged_output=true
3209.menu.bootloader.uart0_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
3209.menu.bootloader.uart1_default.upload.maximum_size=32256
3209.menu.bootloader.uart1_default.upload.protocol=arduino
3209.menu.bootloader.uart1_default.upload.port=UART1_DEF
3209.menu.bootloader.uart1_default.upload.extra_params=
3209.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
3209.menu.bootloader.uart1_default.build.export_merged_output=true
3209.menu.bootloader.uart1_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart1_default.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
3209.menu.bootloader.uart1_alternative.upload.maximum_size=32256
3209.menu.bootloader.uart1_alternative.upload.protocol=arduino
3209.menu.bootloader.uart1_alternative.upload.port=UART1_ALT
3209.menu.bootloader.uart1_alternative.upload.extra_params=
3209.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
3209.menu.bootloader.uart1_alternative.build.export_merged_output=true
3209.menu.bootloader.uart1_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
3209.menu.bootloader.uart2_default.upload.maximum_size=32256
3209.menu.bootloader.uart2_default.upload.protocol=arduino
3209.menu.bootloader.uart2_default.upload.port=UART2_DEF
3209.menu.bootloader.uart2_default.upload.extra_params=
3209.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
3209.menu.bootloader.uart2_default.build.export_merged_output=true
3209.menu.bootloader.uart2_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart2_default.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
3209.menu.bootloader.uart2_alternative.upload.maximum_size=32256
3209.menu.bootloader.uart2_alternative.upload.protocol=arduino
3209.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
3209.menu.bootloader.uart2_alternative.upload.extra_params=
3209.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
3209.menu.bootloader.uart2_alternative.build.export_merged_output=true
3209.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart3_default=Optiboot (UART3 default pins)
3209.menu.bootloader.uart3_default.upload.maximum_size=32256
3209.menu.bootloader.uart3_default.upload.protocol=arduino
3209.menu.bootloader.uart3_default.upload.port=UART3_DEF
3209.menu.bootloader.uart3_default.upload.extra_params=
3209.menu.bootloader.uart3_default.build.text_section_start=.text=0x200
3209.menu.bootloader.uart3_default.build.export_merged_output=true
3209.menu.bootloader.uart3_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart3_default.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart3_default.bootloader.SYSCFG0=0xC9

3209.menu.bootloader.uart3_alternative=Optiboot (UART3 alternative pins)
3209.menu.bootloader.uart3_alternative.upload.maximum_size=32256
3209.menu.bootloader.uart3_alternative.upload.protocol=arduino
3209.menu.bootloader.uart3_alternative.upload.port=UART3_ALT
3209.menu.bootloader.uart3_alternative.upload.extra_params=
3209.menu.bootloader.uart3_alternative.build.text_section_start=.text=0x200
3209.menu.bootloader.uart3_alternative.build.export_merged_output=true
3209.menu.bootloader.uart3_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3209.menu.bootloader.uart3_alternative.bootloader.BOOTEND=0x02
3209.menu.bootloader.uart3_alternative.bootloader.SYSCFG0=0xC9


