MCUdude/MegaCoreX/megaavr/boards.txt
####################
#### ATmega3208 ####
####################

# General
3208.name=ATmega3208
3208.upload.tool=avrdude
3208.upload.maximum_data_size=4096
3208.upload.speed=115200
3208.bootloader.tool=avrdude
3208.build.core=coreX-corefiles
3208.build.board=AVR_ATmega3208
3208.build.mcu=atmega3208
3208.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
3208.bootloader.WDTCFG=0x00
3208.bootloader.TCD0CFG=0x00
3208.bootloader.SYSCFG1=0x06
3208.bootloader.APPEND=0x00
3208.bootloader.LOCKBIT=0xC5

# Pinouts
3208.menu.pinout.32pin_standard=32 pin standard
3208.menu.pinout.32pin_standard.build.variant=32pin-standard
3208.menu.pinout.28pin_standard=28 pin standard
3208.menu.pinout.28pin_standard.build.variant=28pin-standard

# Reset pin
3208.menu.resetpin.reset=Reset
3208.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
3208.menu.resetpin.gpio=GPIO
3208.menu.resetpin.gpio.bootloader.SYSCFG0=0xC1

# Brown out detection
3208.menu.BOD.2v6=BOD 2.6V
3208.menu.BOD.2v6.bootloader.BODCFG=0x54
3208.menu.BOD.4v3=BOD 4.3V
3208.menu.BOD.4v3.bootloader.BODCFG=0xF4
3208.menu.BOD.4v0=BOD 4.0V
3208.menu.BOD.4v0.bootloader.BODCFG=0xD4
3208.menu.BOD.3v7=BOD 3.7V
3208.menu.BOD.3v7.bootloader.BODCFG=0xB4
3208.menu.BOD.3v3=BOD 3.3V
3208.menu.BOD.3v3.bootloader.BODCFG=0x94
3208.menu.BOD.2v9=BOD 2.9V
3208.menu.BOD.2v9.bootloader.BODCFG=0x74
3208.menu.BOD.2v1=BOD 2.1V
3208.menu.BOD.2v1.bootloader.BODCFG=0x34
3208.menu.BOD.1v8=BOD 1.8V
3208.menu.BOD.1v8.bootloader.BODCFG=0x14
3208.menu.BOD.disabled=BOD disabled
3208.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
3208.menu.clock.internal_16MHz=Internal 16 MHz
3208.menu.clock.internal_16MHz.upload.speed=115200
3208.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_16MHz.build.oscillator=
3208.menu.clock.internal_16MHz.build.f_cpu=16000000L

3208.menu.clock.internal_20MHz=Internal 20 MHz
3208.menu.clock.internal_20MHz.upload.speed=115200
3208.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_20MHz.build.oscillator=
3208.menu.clock.internal_20MHz.build.f_cpu=20000000L

3208.menu.clock.internal_10MHz=Internal 10 MHz
3208.menu.clock.internal_10MHz.upload.speed=115200
3208.menu.clock.internal_10MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_10MHz.build.oscillator=
3208.menu.clock.internal_10MHz.build.f_cpu=10000000L

3208.menu.clock.internal_8MHz=Internal 8 MHz
3208.menu.clock.internal_8MHz.upload.speed=115200
3208.menu.clock.internal_8MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_8MHz.build.oscillator=
3208.menu.clock.internal_8MHz.build.f_cpu=8000000L

3208.menu.clock.internal_5MHz=Internal 5 MHz
3208.menu.clock.internal_5MHz.upload.speed=115200
3208.menu.clock.internal_5MHz.bootloader.OSCCFG=0x02
3208.menu.clock.internal_5MHz.build.oscillator=
3208.menu.clock.internal_5MHz.build.f_cpu=5000000L

3208.menu.clock.internal_4MHz=Internal 4 MHz
3208.menu.clock.internal_4MHz.upload.speed=115200
3208.menu.clock.internal_4MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_4MHz.build.oscillator=
3208.menu.clock.internal_4MHz.build.f_cpu=4000000L

3208.menu.clock.internal_2MHz=Internal 2 MHz
3208.menu.clock.internal_2MHz.upload.speed=115200
3208.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_2MHz.build.oscillator=
3208.menu.clock.internal_2MHz.build.f_cpu=2000000L

3208.menu.clock.internal_1MHz=Internal 1 MHz
3208.menu.clock.internal_1MHz.upload.speed=115200
3208.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
3208.menu.clock.internal_1MHz.build.oscillator=
3208.menu.clock.internal_1MHz.build.f_cpu=1000000L

3208.menu.clock.external_16MHz=External 16 MHz
3208.menu.clock.external_16MHz.upload.speed=115200
3208.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_16MHz.build.f_cpu=16000000L

3208.menu.clock.external_12MHz=External 12 MHz
3208.menu.clock.external_12MHz.upload.speed=115200
3208.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_12MHz.build.f_cpu=12000000L

3208.menu.clock.external_8MHz=External 8 MHz
3208.menu.clock.external_8MHz.upload.speed=115200
3208.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_8MHz.build.f_cpu=8000000L

3208.menu.clock.external_4MHz=External 4 MHz
3208.menu.clock.external_4MHz.upload.speed=115200
3208.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_4MHz.build.f_cpu=4000000L

3208.menu.clock.external_1MHz=External 1 MHz
3208.menu.clock.external_1MHz.upload.speed=115200
3208.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
3208.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
3208.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
3208.menu.bootloader.no_bootloader=No bootloader
3208.menu.bootloader.no_bootloader.upload.maximum_size=32768
3208.menu.bootloader.no_bootloader.upload.extra_params=
3208.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
3208.menu.bootloader.no_bootloader.build.export_merged_output=false
3208.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
3208.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

3208.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
3208.menu.bootloader.uart0_default.upload.maximum_size=32256
3208.menu.bootloader.uart0_default.upload.protocol=arduino
3208.menu.bootloader.uart0_default.upload.port=UART0_DEF
3208.menu.bootloader.uart0_default.upload.extra_params=
3208.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart0_default.build.export_merged_output=true
3208.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart0_default.bootloader.SYSCFG0=0xC9

