MCUdude/MegaCoreX/megaavr/boards.txt
3208.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
3208.menu.bootloader.uart0_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart0_alternative.upload.protocol=arduino
3208.menu.bootloader.uart0_alternative.upload.port=UART0_ALT
3208.menu.bootloader.uart0_alternative.upload.extra_params=
3208.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart0_alternative.build.export_merged_output=true
3208.menu.bootloader.uart0_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0xC9

3208.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
3208.menu.bootloader.uart1_default.upload.maximum_size=32256
3208.menu.bootloader.uart1_default.upload.protocol=arduino
3208.menu.bootloader.uart1_default.upload.port=UART1_DEF
3208.menu.bootloader.uart1_default.upload.extra_params=
3208.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart1_default.build.export_merged_output=true
3208.menu.bootloader.uart1_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart1_default.bootloader.SYSCFG0=0xC9

3208.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
3208.menu.bootloader.uart1_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart1_alternative.upload.protocol=arduino
3208.menu.bootloader.uart1_alternative.upload.port=UART1_ALT
3208.menu.bootloader.uart1_alternative.upload.extra_params=
3208.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart1_alternative.build.export_merged_output=true
3208.menu.bootloader.uart1_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0xC9

3208.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
3208.menu.bootloader.uart2_default.upload.maximum_size=32256
3208.menu.bootloader.uart2_default.upload.protocol=arduino
3208.menu.bootloader.uart2_default.upload.port=UART2_DEF
3208.menu.bootloader.uart2_default.upload.extra_params=
3208.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
3208.menu.bootloader.uart2_default.build.export_merged_output=true
3208.menu.bootloader.uart2_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart2_default.bootloader.SYSCFG0=0xC9

3208.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
3208.menu.bootloader.uart2_alternative.upload.maximum_size=32256
3208.menu.bootloader.uart2_alternative.upload.protocol=arduino
3208.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
3208.menu.bootloader.uart2_alternative.upload.extra_params=
3208.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
3208.menu.bootloader.uart2_alternative.build.export_merged_output=true
3208.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
3208.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
3208.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0xC9


#####################
#### ATmega1609 ####
#####################

# General
1609.name=ATmega1609
1609.upload.tool=avrdude
1609.upload.maximum_data_size=2048
1609.upload.speed=115200
1609.bootloader.tool=avrdude
1609.build.core=coreX-corefiles
1609.build.board=AVR_ATmega1609
1609.build.mcu=atmega1609
1609.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
1609.bootloader.WDTCFG=0x00
1609.bootloader.TCD0CFG=0x00
1609.bootloader.SYSCFG1=0x06
1609.bootloader.APPEND=0x00
1609.bootloader.LOCKBIT=0xC5

# Pinouts
1609.menu.pinout.48pin_standard=48 pin standard
1609.menu.pinout.48pin_standard.build.variant=48pin-standard
1609.menu.pinout.48pin_standard.build.compat=
1609.menu.pinout.uno_wifi=Uno WiFi
1609.menu.pinout.uno_wifi.build.variant=uno-wifi
1609.menu.pinout.uno_wifi.build.compat=

# Reset pin
1609.menu.resetpin.reset=Reset
1609.menu.resetpin.reset.bootloader.SYSCFG0=0xCD
1609.menu.resetpin.gpio=GPIO
1609.menu.resetpin.gpio.bootloader.SYSCFG0=0xC1

# Brown out detection
1609.menu.BOD.2v6=BOD 2.6V
1609.menu.BOD.2v6.bootloader.BODCFG=0x54
1609.menu.BOD.4v3=BOD 4.3V
1609.menu.BOD.4v3.bootloader.BODCFG=0xF4
1609.menu.BOD.4v0=BOD 4.0V
1609.menu.BOD.4v0.bootloader.BODCFG=0xD4
1609.menu.BOD.3v7=BOD 3.7V
1609.menu.BOD.3v7.bootloader.BODCFG=0xB4
1609.menu.BOD.3v3=BOD 3.3V
1609.menu.BOD.3v3.bootloader.BODCFG=0x94
1609.menu.BOD.2v9=BOD 2.9V
1609.menu.BOD.2v9.bootloader.BODCFG=0x74
1609.menu.BOD.2v1=BOD 2.1V
1609.menu.BOD.2v1.bootloader.BODCFG=0x34
1609.menu.BOD.1v8=BOD 1.8V
1609.menu.BOD.1v8.bootloader.BODCFG=0x14
1609.menu.BOD.disabled=BOD disabled
1609.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
1609.menu.clock.internal_16MHz=Internal 16 MHz
1609.menu.clock.internal_16MHz.upload.speed=115200
1609.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
1609.menu.clock.internal_16MHz.build.oscillator=
1609.menu.clock.internal_16MHz.build.f_cpu=16000000L

1609.menu.clock.internal_20MHz=Internal 20 MHz
1609.menu.clock.internal_20MHz.upload.speed=115200
1609.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
1609.menu.clock.internal_20MHz.build.oscillator=
1609.menu.clock.internal_20MHz.build.f_cpu=20000000L

1609.menu.clock.internal_10MHz=Internal 10 MHz
1609.menu.clock.internal_10MHz.upload.speed=115200
1609.menu.clock.internal_10MHz.bootloader.OSCCFG=0x02
1609.menu.clock.internal_10MHz.build.oscillator=
1609.menu.clock.internal_10MHz.build.f_cpu=10000000L

